In [1]:
import pandas as pd
import numpy as np

In [2]:
forum_users = {
    'User_ID': np.array([1, 2, 3, 4, 5]),
    'Username': ['Bogdan_s', 'Jane_Smith', 'Alex123', 'Bob56', 'Mark_Wilson'],
    'Age': [18, 35, 25, 38, 33],
    'Joined date': pd.to_datetime(['2032-01-01', '2032-02-10', '2032-01-19', '2032-01-25', '2032-03-15']),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
} 

df = pd.DataFrame(forum_users)    
df

   User_ID     Username  Age Joined date  Total Posts  Reputation
0        1     Bogdan_s   18  2032-01-01          150         500
1        2   Jane_Smith   35  2032-02-10          230         720
2        3      Alex123   25  2032-01-19           80         200
3        4        Bob56   38  2032-01-25          420         940
4        5  Mark_Wilson   33  2032-03-15          310         500

## Filtring

In [3]:
df.loc[3] # вывод строки с индексом 3 (Series)

User_ID                          4
Username                     Bob56
Age                             38
Joined date    2032-01-25 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [4]:
df.loc[2:3] # вывод строк с индексами от 2 до 3 включительно (DataFrame)

   User_ID Username  Age Joined date  Total Posts  Reputation
2        3  Alex123   25  2032-01-19           80         200
3        4    Bob56   38  2032-01-25          420         940

In [5]:
df.loc[2:3, ['Username', 'Joined date', 'Reputation']]
 # вывод строк с индексами от 2 до 3 включительно и столбцов 
 # Username, Joined date и Reputation

  Username Joined date  Reputation
2  Alex123  2032-01-19         200
3    Bob56  2032-01-25         940

In [6]:
df.iloc[1] # вывод строки с индексом 1 (Series)

User_ID                          2
Username                Jane_Smith
Age                             35
Joined date    2032-02-10 00:00:00
Total Posts                    230
Reputation                     720
Name: 1, dtype: object

In [7]:
df.iloc[2:4] # вывод строк с позициями от 2 до 3 включительно (DataFrame)

   User_ID Username  Age Joined date  Total Posts  Reputation
2        3  Alex123   25  2032-01-19           80         200
3        4    Bob56   38  2032-01-25          420         940

In [8]:
df.iloc[2:4, 1:4]

  Username  Age Joined date
2  Alex123   25  2032-01-19
3    Bob56   38  2032-01-25

In [9]:
df.iloc[:, 1:4] # вывод всех строк и столбцов с позициями от 1 до 3 включительно

      Username  Age Joined date
0     Bogdan_s   18  2032-01-01
1   Jane_Smith   35  2032-02-10
2      Alex123   25  2032-01-19
3        Bob56   38  2032-01-25
4  Mark_Wilson   33  2032-03-15

In [10]:
df[df['Age'] >= 25] # пользователи старше 25 лет

   User_ID     Username  Age Joined date  Total Posts  Reputation
1        2   Jane_Smith   35  2032-02-10          230         720
2        3      Alex123   25  2032-01-19           80         200
3        4        Bob56   38  2032-01-25          420         940
4        5  Mark_Wilson   33  2032-03-15          310         500

In [11]:
df['Age'] >= 25 # булев массив для фильтрации (Series)

0    False
1     True
2     True
3     True
4     True
Name: Age, dtype: bool

In [12]:
df[df['Total Posts'] > 300] # пользователи с количеством постов больше 300

   User_ID     Username  Age Joined date  Total Posts  Reputation
3        4        Bob56   38  2032-01-25          420         940
4        5  Mark_Wilson   33  2032-03-15          310         500

In [13]:
df[df['Reputation'] < 500] # пользователи с репутацией меньше 500

   User_ID Username  Age Joined date  Total Posts  Reputation
2        3  Alex123   25  2032-01-19           80         200

In [14]:
df[(df['Total Posts'] >= 300) & (df['Age'] >= 25)] # пользователи старше 25 лет с количеством постов больше или равно 300

   User_ID     Username  Age Joined date  Total Posts  Reputation
3        4        Bob56   38  2032-01-25          420         940
4        5  Mark_Wilson   33  2032-03-15          310         500

In [15]:
(df['Total Posts'] >= 300) & (df['Age'] >= 25) # пользователи старше 25 лет с количеством постов больше или равно 300
# (Series булев массив для фильтрации)

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [16]:
df[(df['Total Posts'] >= 400) | (df['Age'] <= 25)] # пользователи с количеством постов больше или равно 300 или младше 25 лет

   User_ID  Username  Age Joined date  Total Posts  Reputation
0        1  Bogdan_s   18  2032-01-01          150         500
2        3   Alex123   25  2032-01-19           80         200
3        4     Bob56   38  2032-01-25          420         940

In [17]:
df['Reputation'].isin([200, 500]) # пользователи с репутацией 200 или 500 
# Serial

0     True
1    False
2     True
3    False
4     True
Name: Reputation, dtype: bool

In [18]:
df[df['Reputation'].isin([200, 500])] # пользователи с репутацией 200 или 500
# df filter

   User_ID     Username  Age Joined date  Total Posts  Reputation
0        1     Bogdan_s   18  2032-01-01          150         500
2        3      Alex123   25  2032-01-19           80         200
4        5  Mark_Wilson   33  2032-03-15          310         500

In [19]:
df[df['Reputation'].isin(range(200, 500))] # пользователи с репутацией 200 или 500

   User_ID Username  Age Joined date  Total Posts  Reputation
2        3  Alex123   25  2032-01-19           80         200

In [20]:
df[df['Total Posts'].isin(range(200, 350))] # пользователи с количеством постов от 200 до 349

   User_ID     Username  Age Joined date  Total Posts  Reputation
1        2   Jane_Smith   35  2032-02-10          230         720
4        5  Mark_Wilson   33  2032-03-15          310         500

In [21]:
date_range = pd.date_range(start='2032-01-15', end='2032-02-15')  
date_range # диапазон дат переменной date_range

DatetimeIndex(['2032-01-15', '2032-01-16', '2032-01-17', '2032-01-18',
               '2032-01-19', '2032-01-20', '2032-01-21', '2032-01-22',
               '2032-01-23', '2032-01-24', '2032-01-25', '2032-01-26',
               '2032-01-27', '2032-01-28', '2032-01-29', '2032-01-30',
               '2032-01-31', '2032-02-01', '2032-02-02', '2032-02-03',
               '2032-02-04', '2032-02-05', '2032-02-06', '2032-02-07',
               '2032-02-08', '2032-02-09', '2032-02-10', '2032-02-11',
               '2032-02-12', '2032-02-13', '2032-02-14', '2032-02-15'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df[df['Joined date'].isin(date_range)]  # пользователи, присоединившиеся в период с 15 января по 15 февраля 2032 года

   User_ID    Username  Age Joined date  Total Posts  Reputation
1        2  Jane_Smith   35  2032-02-10          230         720
2        3     Alex123   25  2032-01-19           80         200
3        4       Bob56   38  2032-01-25          420         940

## Sorting

In [23]:
df.sort_values(by='Age') # сортировка по возрастанию возраста

   User_ID     Username  Age Joined date  Total Posts  Reputation
0        1     Bogdan_s   18  2032-01-01          150         500
2        3      Alex123   25  2032-01-19           80         200
4        5  Mark_Wilson   33  2032-03-15          310         500
1        2   Jane_Smith   35  2032-02-10          230         720
3        4        Bob56   38  2032-01-25          420         940

In [24]:
df.sort_values(by='Joined date', ascending=False)  # сортировка по убыванию даты присоединения

   User_ID     Username  Age Joined date  Total Posts  Reputation
4        5  Mark_Wilson   33  2032-03-15          310         500
1        2   Jane_Smith   35  2032-02-10          230         720
3        4        Bob56   38  2032-01-25          420         940
2        3      Alex123   25  2032-01-19           80         200
0        1     Bogdan_s   18  2032-01-01          150         500

In [27]:
df[['User_ID', 'Total Posts', 'Reputation']]

   User_ID  Total Posts  Reputation
0        1          150         500
1        2          230         720
2        3           80         200
3        4          420         940
4        5          310         500

In [25]:
df[['User_ID', 'Total Posts', 'Reputation']].sort_values(by=2, axis=1, ascending=False,) 
# сортировка столбцов по убыванию количества постов и возрастанию репутации 
# по оси столбцов (axis=1)

   Reputation  Total Posts  User_ID
0         500          150        1
1         720          230        2
2         200           80        3
3         940          420        4
4         500          310        5

In [26]:
df.sort_values(by='Total Posts') # сортировка по возрастанию количества постов

   User_ID     Username  Age Joined date  Total Posts  Reputation
2        3      Alex123   25  2032-01-19           80         200
0        1     Bogdan_s   18  2032-01-01          150         500
1        2   Jane_Smith   35  2032-02-10          230         720
4        5  Mark_Wilson   33  2032-03-15          310         500
3        4        Bob56   38  2032-01-25          420         940